app/controllers/notes_controller.rb

SELECT  "notes".* FROM "notes" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT "taggings".* FROM "taggings" WHERE "taggings"."tag_id" IN (3, 2, 1, 4, 7, 6, 5)
SELECT COUNT(*) FROM "notes"
---
  def index
    @pagy, @notes = pagy(
      Note.preload(:taggings).includes(:tags).all,  items: 9, page: params[:page])

INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My first note"], ["body", "This is my first ever note."], ["created_at", "2019-07-09 19:53:37.518933"], ["updated_at", "2019-07-09 19:53:37.518933"]]
---
  def create
    @note = Note.new(create_params)
    if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @note = NoteDecorator.new(Note.find(params[:id]))